{
  "events": [
    {
      "id": "1",
      "title": "UI / UX Designing",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Unleash your inner design maverick at TechnoMorph! This event delves into the art and science of crafting intuitive digital interfaces and seamless user experiences. Dive into a fast-paced, hands-on challenge where creativity meets functionality, and explore the principles of design thinking to create applications that don’t just meet expectations—they exceed them. Whether you’re a designer, developer, or simply passionate about user-centric design, this is your gateway to mastering the craft of building interfaces that users love and experiences that resonate. Ready to morph your skills into something extraordinary? Let’s design the future, one interface at a time!",
      "rules": "General Instructions/Rules:<br>1.Registration:<br><ul><li> Registration will be through an online form.</li><li>Registrations will be conducted on a first-come-first-serve basis. A maximum of 20 teams will be allowed to register after which registration will be closed.</li><li>The form will be closed on 9th October 2024 at 11:59 PM. OR if the maximum number of teams(20) is reached.</li><li>Participants in the same team need not be from the same college/ higher secondary school.</li></ul><br>2.Problem Statement Allocation:<ul><li>Problem statements will be revealed 1 hour before the start of the competition, at 9 AM.</li><li>Problem statements will be assigned through a random draw. Participants should report to the C4 Lab by 9:30 AM for the same.</li><li>Once a problem statement is picked, it cannot be changed.</li></ul>3.Design Requirements<ul><li>Participants are required to use the free version of Figma for designing their solutions.</li><li>Designs must include interactive prototypes.</li><li> The wireframes should clearly outline the structure and layout of the interface.</li><li>The use of plugins is permitted; however, the use of AI is prohibited. All designs must be original. Teams will be disqualified if any form of plagiarism is detected.</li><li>Participants are required to bring their own laptops and any additional hardware they may need. Wifi will be provided.</li></ul>4.Time Limit<ul><li>Participants will have 3.5 hours, from 10:00 AM to 1:30 PM, to complete their designs following the selection of their problem statement. The project link must be shared with the coordinators at the beginning of the event.</li><<li> All submissions must be finalized and submitted before the time limit expires. Participants may leave for lunch at 1:30 PM and must report back at 2:00 PM. Judging will take place from 2:00 PM to 4:00 PM.</li>/ul>",
      "contacts": [
        {
          "name": "Faizan Akabani",
          "number": "8390109186"
        },
        {
          "name": "Tushar",
          "number": ""
        }
      ]
    },
    {
      "id": "2",
      "title": "Inspirathon",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Everybody has a creative potential and from the moment you can express this creative potential, you can start changing the world ~Paulo Coelho Bring your team and over 24-hours, you'll be tasked with developing a solution for our (currently secret👀) topics! The hackathon is for students of any level and background to get involved in! Yes we have prizes for our winners, but the aim of the event is to inspire, so get involved and give it a go!!",
      "rules": "Eligibility:<br><ul><li>Students must be currently enrolled in an undergraduate, diploma, professional, or non-professional institution and possess a valid institute ID.</li><li>Each team must consist of exactly 3 members, all of whom must be current students.</li><li>A maximum of 4 teams per college is allowed, including interdepartmental teams. Intercollege teams do not count towards this limit.</li><li>If a college's team count exceeds 4, additional teams will only be considered if the total number of participating teams (i.e., 15) has not been reached.</li><li>Final acknowledgment of teams will be given once registration closes.</li></ul><br>Rules:<br><ul><li>Teams may use any programming language or software of their choice.</li><li>Teams must bring their own laptops and any necessary hardware.</li><li>Online registrations will close on October 6th at 5:00 PM or once a maximum of 15 teams have registered, on a first-come, first-serve basis.</li><li>On October 8th at 10:00 AM, problem statements will be released in a designated WhatsApp group, and teams must select and confirm their chosen problem by uploading their selection to the group. Allocation is first-come, first-serve, and once a problem is selected, it will no longer be available to others.</li><li>All development work must be completed at the hackathon venue.</li><li>Wi-Fi access and power points will be provided.</li><li>Teams must report to the venue by 9:00 AM on October 10th.</li><li>The hackathon begins at 10:00 AM on October 10th and ends at 10:00 AM on October 11th. Participants may take breaks but cannot leave the venue until the hackathon ends.</li><li>Teams will present their solutions to judges after the hackathon concludes. Each presentation will last 5 minutes, followed by a 5-minute Q&A session.</li><li>Presentations will be shown on a projector; teams must connect their systems via LAN, HDMI, or Wi-Fi.</li><li>The judges' decisions are final in case of any discrepancies.</li></ul><br>Judging Criteria:<ul><li>Solution to Problem (60%)</li><li>Creativity (15%)</li><li>Innovation (15%)</li><li>Presentation (10%)</li></ul>",
      "contacts": [
        {
          "name": "Sonal Gaonkar",
          "number": "7666437251"
        },
        {
          "name": "Sairaj",
          "number": ""
        }
      ]
    },
    {
      "id": "3",
      "title": "Framed (online)",
      "image": "https://cdn.midjourney.com/36853a23-c24a-455a-9642-068e16db8cc3/0_0.png",
      "description": "An online digital photography competition open to students across India. Participants are invited to submit their best photographs, showcasing their skills in capturing moments and telling stories through their lens, with winners recognized for their creativity and technical prowess.",
      "rules": "General Instructions/Rules:<br><ul><li>Participants must submit a total of 3 photos, each adhering strictly to the specified criteria.</li><li>Photos should be submitted in .jpeg, .jpg, or .png format.</li><li>Both mobile phones and DSLRs are allowed for capturing photos.</li><li>All photos must be taken within the designated time period.</li><li>Photos should retain all original metadata.</li><li>Basic editing, such as color enhancement and cropping, is allowed.</li><li>Advanced editing techniques like creating illusions, manipulation, applying filters, adding or removing significant elements, and adding watermarks are prohibited.</li><li>Each photo submission must include a unique caption. Participants may also provide a description if they feel their photo tells a story.</li><li>Image files should be renamed as 'img_1', 'img_2', and 'img_3' before submission.</li><li>All photo details will be thoroughly checked.</li><li>Participants must submit only original photos taken by themselves. Any instance of plagiarism or cheating will result in disqualification.</li><li>Participants found submitting photos taken from the internet will be disqualified.</li><li>Exceeding the submission time limit will result in disqualification.</li><li>Late registrations will not be accepted.</li><li>Use of drones for photography is prohibited.</li><li>Violation of any instructions will lead to disqualification.</li></ul><br><strong>Topics Announcement:</strong><br><ul><li>Topics for the contest will be displayed on the website the day before the event at 9:00 pm.</li><li>Certain topics will require participants to be present on campus for photography, while others may not.</li><li>All three images submitted do not necessarily have to be from different topics.</li></ul>",
      "contacts": [
        {
          "name": "Jordan Fernandes",
          "number": ""
        },
        {
          "name": "Gretchen",
          "number": ""
        }
      ]
    },
    {
      "id": "4",
      "title": "CodeClash",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "CodeClash is an engaging competition that combines coding challenges with interactive mini-games. Teams will test their problem-solving skills through a series of tasks, including blind coding, error correction, and a coding showdown. The event requires participants to excel in both coding and game performance.",
      "prerequisites": "<ul><li>Proficiency in C++.</li><li>Basic understanding of debugging and problem-solving.</li><li>Familiarity with coding practices and logical reasoning.</li></ul>",
      "rules": "<ul type='disc'><li>Each team will consist of 2 participants: a Coder and a Player.</li><li>The top 6 teams from Round 1 will receive a 10-minute advantage in Round 2.</li><li>The top 12 teams will advance from Round 1 to Round 2.</li><li>The top 4 teams from Round 2 will receive an additional 5 minutes in Round 3.</li><li>The top 6 teams will advance from Round 2 to Round 3.</li><li>In case of a tie, a sudden-death coding challenge will be used to determine the winner.</li><li>Teams should work together according to the format of each round.</li></ul><br>Round Descriptions and Rules:<br><ul><li><strong>Round 1: Coding & Mini-Games (45 minutes)</strong><ul><li>Format: Each team consists of two participants: Coder and Player.</li><li>Objective: Solve a mathematical expression through coding and participate in a mini-game challenge.</li><li>Part 1 - Blind Coding:<ul><li>Task: Coder has 10 minutes to blind code a solution to a provided mathematical expression using C++. After 10 minutes, the code is tested.</li><li>Points: 30</li><li>Advantage: The top 6 teams get a 10-minute advantage in the next round.</li><li>Elimination: The top 12 teams advance to Round 2.</li></ul></li><li>Part 2 - Mini-Game:<ul><li>Task: Player participates in a mini-game similar to 'minute to win it' challenges for 10 minutes.</li><li>Points: Up to 20</li></ul></li></ul></li><li><strong>Round 2: Solve the Error (20 minutes)</strong><ul><li>Format: Teams are given a slightly complex logical problem with errors in a provided program.</li><li>Objective: Identify and correct the errors to ensure the program runs successfully.</li><li>Task: Both Coder and Player work together to debug and correct the provided program. The Player assists by reviewing the logic and suggesting possible corrections.</li><li>Points: 40</li><li>Advantage: The top 4 teams receive an additional 5 minutes in the final round.</li><li>Elimination: The top 6 teams proceed to Round 3.</li></ul></li><li><strong>Round 3: Coding Showdown (1 hour)</strong><ul><li>Format: A coding challenge where both participants tackle normal coding questions.</li><li>Objective: Solve as many coding problems as possible within the given time.</li><li>Task: Coder and Player decide whether to work separately on different problems or together on the same problems. The Player can assist by testing the solutions or suggesting strategies but cannot code.</li><li>Points: Points are awarded based on the number and complexity of problems solved.</li></ul></li></ul><br><strong>Winner:</strong> The team with the highest score at the end wins the event.<br><strong>Tie Breaker Round:</strong><ul><li>Task: If there's a tie, a sudden-death coding challenge determines the winner.</li></ul>",
      "judgingCriteria": "<ul><li>Correctness: Accuracy and functionality of the solutions.</li><li>Performance: Effective use of the given time and resources.</li><li>Code Quality: Structure and efficiency of the code.</li><li>Mini-Game Score: Points earned in the mini-game segment.</li></ul>",
      "contacts": [
        {
          "name": "Jay Rane",
          "number": "8208516322"
        },
        {
          "name": "Kshitij",
          "number": ""
        }
      ]
    },
    {
      "id": "5",
      "title": "ExQuizite",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Knowledge is the key!! Quiz is the game!! ExQuizite is the way you can get fame!! Sharpen your brains, Gather in the field, Fight for the title! ExQuizite is a quiz that will challenge you and test your knowledge of Science and Technology along with General knowledge, Entertainment & Sports.",
      "rules": "General Instructions/Rules:<br><ul><li>1. Team Composition: All team members must be from the same college. No intercollege teams are permitted. If a team is found to have members from different colleges, they will be disqualified. Replacement of any participant after registration is not allowed. However, in the event of an unforeseen circumstance (e.g., illness), a replacement may be permitted with prior approval from the organizers, provided it is 2 hours before the preliminary round i.e. 11 a.m.</li><li>2. Registration: There is a limit of 5 teams per college, determined on a first-come-first-serve basis. A maximum of 30 teams will be allowed to register. Once this limit is reached, registrations will be closed.</li><li>3. Theme and Topics: The quiz will cover the following themes: Science & Technology, Sports & Entertainment, Arts & Humanities, Social Sciences, Food & Lifestyle, and General Knowledge. Questions will be evenly distributed across these themes.</li><li>4. Preliminary Round: There will be exactly 5 teams moving onto the Main round. If more than 5 teams register, only then the preliminary round will be conducted to eliminate teams based on points. The preliminary round format, scoring system, and point-based elimination criteria will be announced before the start of the round. In case of a tie during the preliminary round, an additional 10 MCQ questions will be asked to each of the teams on Kahoot.</li><li>5. Main Rounds: The top 5 teams qualifying from preliminary round 2 will advance to the main round, where the final 2 winning teams will be determined. If scores are tied for 1st or 2nd place in the main round, a tie-breaker round will be conducted to determine the winners. The rules for each round will be clearly announced before the round begins. Teams are responsible for understanding the rules; they may ask for clarification before the round starts. No objections will be entertained once the round has begun.</li><li>6. Team Withdrawal: If a team leaves the quiz midway, they will not be allowed to compete further.</li><li>7. Decision of the Quiz Masters: The decision of the quiz masters will be final and not subject to change. However, in the event of a significant error identified after a decision, the matter will be reviewed, and necessary corrections will be made at the discretion of the organizers.</li><li>8. Tie-Breaker Rules: In the case of a tie for 1st or 2nd place in the main round, the tie-breaker will consist of 3 questions. The team with the highest score in the tie-breaker will be declared the winner. The order of set selection for the tie-breaker will be based on a coin toss.</li><li>9. Voice/Video Recording: A voice/video recording of each team answering the questions will be taken. In case of any discrepancies, the recording will be treated as evidence for making the final decision. If the recording fails or is inconclusive, the quiz master's decision will be final.</li></ul>",
      "contacts": [
        {
          "name": "Eric Faleiro",
          "number": "8623069543"
        },
        {
          "name": "Jayden Gomes",
          "number": "9370002388"
        }
      ]
    },
    {
      "id": "6",
      "title": "CryptoQuest",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "In CryptoQuest, participants are provided with code snippets that need to be combined to form a complete and functional solution to a given problem statement. This event tests logical thinking and coding skills in a challenging and engaging way.",
      "contacts": [
        {
          "name": "Ritesh D. Chari",
          "number": "9356132475"
        },
        {
          "name": "Sifhat",
          "number": ""
        }
      ]
    },
    {
      "id": "7",
      "title": "Reel Ad making (Reel it Feel it)",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Create an Instagram reel featuring a comically exaggerated fake product. Participants are tasked with producing the most entertaining and creative reel, with the best reel receiving recognition. This event emphasizes creativity and humor in digital content creation.",
      "contacts": [
        {
          "name": "Faizan Akabani",
          "number": "8390109186"
        },
        {
          "name": "Marco",
          "number": ""
        }
      ]
    },
    {
      "id": "8",
      "title": "Memes (online)",
      "image": "https://cdn.midjourney.com/039e60c9-6ae9-4116-9eea-99aa3fd80a68/0_3.png",
      "description": "Showcase your meme-making skills by creating humorous and creative memes. This online competition encourages participants to use their wit and creativity to craft memes that will entertain and amuse the audience, with the most engaging memes winning.",
      "contacts": [
        {
          "name": "Lauren Rodrigues",
          "number": "9156981587"
        },
        {
          "name": "Rakesh",
          "number": ""
        }
      ]
    },
    {
      "id": "9",
      "title": "Rubiks Cube",
      "image": "https://cdn.midjourney.com/d6434eba-b6a9-414d-a8a9-e1f83230c90b/0_0.png",
      "description": "Cubix is an exciting competition where contestants race against the clock to solve a 3x3 Rubik's cube, aiming to align all faces to the same color. This event highlights the speed and skill of cubers as they manipulate the cube through complex twists and turns. It's a thrilling display of mental agility and finger dexterity, open to both novices and experienced cubers.",
      "rules": "General Instructions/Rules:<br><ul><li>Competitors must bring their own 3x3 Rubik’s cubes for the competition.</li><li>Puzzles must be clean and free from any markings, elevated pieces, damage, or significant differences that could affect the competition.</li><li>All solves will be timed using a computer.</li><li>A 10-second inspection time will be provided before each solve.</li><li>Each competitor's average time will be calculated from 2 rounds.</li><li>If two or more participants have the same average time, a tie-breaker round will be held.</li><li>While competing, the use of electronics or audio equipment (e.g., cell phones, MP3 players, Dictaphones, additional lighting) is prohibited.</li></ul>",
      "contacts": [
        {
          "name": "Sherwin Lourenco",
          "number": "7391804162"
        },
        {
          "name": "Cynora",
          "number": ""
        }
      ]
    },
    {
      "id": "10",
      "title": "Escapium (Escape Room)",
      "image": "https://cdn.midjourney.com/f7c94415-9c72-450a-a635-4912f1a46e8b/0_1.png",
      "description": "Test your puzzle-solving skills in a race against time within an escape room scenario. Participants must use their critical thinking and teamwork to solve puzzles and escape the room before the time runs out.",
      "contacts": [
        {
          "name": "Meha Dangui",
          "number": "8421640719"
        },
        {
          "name": "Diya",
          "number": ""
        }
      ]
    },
    {
      "id": "11",
      "title": "Masterclass",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Join the Masterclass for a series of fun games and friendly competitions. This event is designed to be a social gathering where participants can engage in enjoyable activities and challenge their friends in a relaxed and friendly environment.",
      "contacts": [
        {
          "name": "Ananya Sawant",
          "number": "7387797988"
        },
        {
          "name": "Griselda Fernandes",
          "number": ""
        }
      ]
    }
  ]
}