{
  "events": [
    {
      "id": "1",
      "title": "Inspirathon",
      "image": "https://cdn.midjourney.com/8d69c523-1974-47af-b3da-a99da28bb7e2/0_2.jpeg",
      "description": "Everybody has a creative potential and from the moment you can express this creative potential, you can start changing the world ~Paulo Coelho Bring your team and over 24-hours, you'll be tasked with developing a solution for our (currently secret👀) topics! The hackathon is for students of any level and background to get involved in! Yes we have prizes for our winners, but the aim of the event is to inspire, so get involved and give it a go!!",
      "rules": "<br><ul><li>Teams can use any programming language or software of their choice.</li><li>Teams have to carry their own laptops/hardware.</li><li>Online registrations will close on the 6th of October at 5:00 PM or once a maximum of 15 teams have registered, on a FIRST COME FIRST SERVE basis.</li><li>On the 8th of October at 10:00 AM, problem statements will be released by the coordinators on the designated WhatsApp group, 48 hours before the event. On the same day, teams must choose one problem statement and upload their selection via the designated WhatsApp group.</li><li>The allocation process of the problem statement will take place on a FIRST COME FIRST SERVE basis. Thereafter, that particular statement will no longer be available to the rest of the participants.</li><li>All development work on the problem statement should be done at the Hackathon venue.</li><li>Wi-Fi access and power points/Extensions will be made available at the venue.</li><li>Teams have to report at the venue by 9:00 AM on 10th October.</li><li>Refreshments will be provided:<ul><li>Day 1: Dinner</li><li>Day 2: Breakfast</li></ul></li><li>All refreshments are to be consumed in the pantry.</li><li>The Hackathon will begin at 10:00 AM on 10th October and will end at 10:00 AM on 11th October. The teams are free to take breaks in between.</li><li>The teams will not be provided with any additional accommodation.</li><li>Teams are not allowed to leave the venue until the end of the hackathon.</li><li>After the duration of the hackathon is over, participants have to be ready with their final demo/presentation of their apps/websites in all manners to present to the judges. No extra time will be given for the same.</li><li>Each team will have five minutes to present their solution to the judges, followed by a 5-minute Q&A session.</li><li>Presentations and demos will be shown on a projector connected to your system (LAN, HDMI, Wi-Fi).</li><li>In case of discrepancy, decisions made by the judges will be final.</li></ul></li><br><strong>Judging Criteria</strong><ul><li>Solution to problem (60%)</li><li>Creativity (15%)</li><li>Innovation (15%)</li><li>Presentation (10%)</li></ul></li></ul>",
      "register": "https://forms.gle/ggxbVRnVu7vEJjy6A",
      "date": "<b><p>10th & 11th October 2024</b></p>",
      "technical": true,
      "time": "10:00 am to 10:00 am",
      "inner_image": "/Coordinator Pics/Inspirathon/1.png",
      "venue": "<p>Venue: <b>Auditorium(2nd floor)</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>Minimum 1 member <br> and Maximum 3 members per team</b></p>",
      "teamnumber": "3",
      "prizes": "<p>1st Place: ₹4000</p><p>2nd Place: ₹3000</p><p>3rd Place: ₹2000</p>",
      "roundinfo": "<strong><center>No detours, no rounds—just the final showdown!<strong><center>",
      "eligibility": "<ul><br><li>Students from Undergraduate, Diploma, professional, and non-professional institutions.</li><li>Students should possess a valid institute ID.</li><li>Team members must be current students.</li><li>Minimum 1 member and maximum 3 members per team.</li><li>There will be a maximum of 4 teams allowed per college, including interdepartmental teams. However, if a team consists of members from different colleges, it will not count towards the 4-team limit for any single college.</li><li>If the number of teams from a college exceeds the 4-team limit, additional teams will only be considered if the total number of participating teams (i.e., 15) has not been reached.</li><li>The final acknowledgment of the teams will be given once the registration is closed.</li></ul></li>",
      "contacts": [
        {
          "name": "Sonal Gaonkar",
          "number": "https://wa.me/+917666437251",
          "image": "/Coordinator Pics/Inspirathon/TE 1.jpg"
        },
        {
          "name": "Sairaj Chari",
          "number": "https://wa.me/+919699365405",
          "image": "/Coordinator Pics/Inspirathon/SE.jpeg"
        }
      ]
    },
    {
      "id": "2",
      "title": "Technomorph",
      "image": "https://cdn.midjourney.com/9882c596-0357-4c71-9a03-af8858e2e9f4/0_3.png",
      "inner_image": "/Coordinator Pics/TechnoMorph/1.png",
      "description": "Unleash your design potential at TechnoMorph! This fast-paced, hands-on challenge blends creativity with functionality to craft seamless digital interfaces and user experiences.Ready to transform your skills? Let’s design the future, one interface at a time!",
      "rules": "<strong>Pre-requisites:</strong><ul><li>Familiarity with Figma</ul><br><strong>General Instructions/Rules:</strong><br><ul><br><strong>Registration:</strong><ul><li>Registration will be through an online form.</li><li>Registrations will be conducted on a first-come-first-serve basis. A maximum of 20 teams will be allowed to register after which registration will be closed.</li><li>The form will be closed on 9th October 2024 at 11:59 PM OR if the maximum number of teams (20) is reached.</li><li>Participants in the same team need not be from the same college/higher secondary school.</li></ul></li><br><strong>Problem Statement Allocation:</strong><ul><li>Problem statements will be revealed 1 hour before the start of the competition, at 9 AM.</li><li>Problem statements will be assigned through a random draw. Participants should report to the C4 Lab by 9:30 AM for the same.</li><li>Once a problem statement is picked, it cannot be changed.</li></ul></li><br><strong>Design Requirements:</strong><ul><li>Participants are required to use the free version of Figma for designing their solutions.</li><li>Designs must include interactive prototypes.</li><li>The wireframes should clearly outline the structure and layout of the interface.</li><li>The use of plugins is permitted; however, the use of AI is prohibited. All designs must be original. Teams will be disqualified if any form of plagiarism is detected.</li><li>Participants are required to bring their own laptops and any additional hardware they may need. Wifi will be provided.</li></ul></li><strong><br>Time Limit:</strong><ul><li>Participants will have 3.5 hours, from 10:00 AM to 1:30 PM, to complete their designs following the selection of their problem statement. The project link must be shared with the coordinators at the beginning of the event.</li><li>All submissions must be finalized and submitted before the time limit expires. Participants may leave for lunch at 1:30 PM and must report back at 2:00 PM. Judging will take place from 2:00 PM to 4:00 PM.</li></ul></li><strong><br>Submission Guidelines:</strong><ul><li>All designs must be submitted as a project link or files via email.</li><li>Ensure that the file is shared with edit access disabled and view access enabled for the coordinators.</li></ul></li><strong><br>Presentation Guidelines:</strong><ul><li>During the judging round, participants are required to present their designs, addressing the following key areas: Problem Statement, Design Process, Prototype Demonstration.</li><li>PowerPoint is optional.</li><li>Each team will have 5 minutes to present.</li></ul></li><strong><br>Judging Criteria:</strong><ul><li>Usability</li><li>Navigation</li><li>Visual Design and Consistency</li><li>Creativity and Originality</li><li>Relevance</li><li>Presentation</li><li>Feasibility</li><li>Overall Impact</li></ul></li></ul>",
      "register": "https://docs.google.com/forms/d/e/1FAIpQLScSh5DpcVkCOfKcCkQWrOH-VQBQUi3CUb2G4xmRHFRY0eD-Qg/viewform?usp=sf_link",
      "date": "<p>Date: <b>10th October 2024</b></p>",
      "time": "10:00 am to 4:00 pm",
      "technical": true,
      "venue": "<p>Venue: <b>C4 and C9 Lab</b></p>",
      "mode": "offline",
      "members": "<p><Members: <b>Maximum 2 per Team</b></p>",
      "teamnumber": "2",
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "eligibility": "Students from Undergraduate, Diploma, professional and non-professional institutions.",
      "contacts": [
        {
          "name": "Nathania Baptista",
          "number": "https://wa.me/+918459128894",
          "image": "/Coordinator Pics/TechnoMorph/TE 1.jpg"
        },
        {
          "name": "Thushar Jithendran Nair",
          "number": "https://wa.me/+918975949676",
          "image": "/Coordinator Pics/TechnoMorph/SE.jpeg"
        }
      ]
    },
    {
      "id": "3",
      "title": "Framed ",
      "image": "https://cdn.midjourney.com/36853a23-c24a-455a-9642-068e16db8cc3/0_0.png",
      "inner_image": "/Coordinator Pics/Framed/1.png",
      "description": "An online digital photography competition open to students across India. Participants are invited to submit their best photographs, showcasing their skills in capturing moments and telling stories through their lens, with winners recognized for their creativity and technical prowess.",
      "rules": "<strong>General Instructions/Rules:</strong><br><br><ul><li>Participants must submit a total of 3 (three) photos, where each photo completely follows the criteria mentioned.</li><li>Participants should submit photos in .jpeg, .jpg, or .png format.</li><li>Participants are allowed to use Mobile phones and DSLRs.</li><li>Photos should be taken between the given time period.</li><li>Photos should include all the original metadata.</li><li>Basic editing such as color enhancement and cropping of the photo is allowed.</li><li>Advanced editing used to create an illusion, manipulation, filters and adding/removing of significant elements, and watermarks within the frame are prohibited.</li><li>Participants are required to provide a unique caption for the images submitted. Participants can describe the image a little bit if they feel their picture tells a story.</li><li>Submit your image files renamed as 'img_1,' 'img_2,' & 'img_3.'</li><li>All the details of the photo will be checked.</li><li>Participants have to submit only original images (Images that are taken by you and not anyone else). In case we confirm any instance of a Participant copying someone else's pictures and submitting them as their own, or otherwise cheating in the competition, they will be directly disqualified.</li><li>Any Participant found submitting pictures taken from the internet will directly be disqualified.</li><li>Exceeding the submission time limit will lead to disqualification.</li><li>Late registration will not be entertained.</li><li>Use of drones is not allowed.</li><li>Violation of the instructions will lead to disqualification.</li><li>The topics for the photography event will be shared in the WhatsApp group the night before the event at 9:00 pm. Some of the topics will require you to be on campus to take the photos, while others won't. You need to submit three photos, but they don't all have to be based on different topics; you can use the same topic for more than one photo if you like.</li></ul>",
      "register": "https://forms.gle/oKEWnF1FkcNrjvat7",
      "date": "<b><p>10th October 2024</b></p>",
      "time": "10:00 am ",
      "venue": "<p>Venue: <b>NA</b></p>",
      "technical": false,
      "mode": "offline/online",
      "members": "<p>Members: <b>Solo</b></p>",
      "teamnumber": "1",
      "prizes": "<p>1st Place: ₹1000</p><p>2nd Place: ₹500</p>",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "eligibility": "Students from Undergraduate, Diploma from Professional and Non-professional Institutions and Higher Secondary Schools",
      "contacts": [
        {
          "name": "Jordan Fernandes",
          "number": "https://wa.me/+919623256162",
          "image": "/Coordinator Pics/Framed/TE 1.jpeg"
        },
        {
          "name": "Luke Fernandes",
          "number": "https://wa.me/+919423875654",
          "image": "/Coordinator Pics/Framed/SE.jpeg"
        }
      ]
    },
    {
      "id": "4",
      "title": "CodeClash",
      "image": "https://cdn.midjourney.com/6c59d26e-def6-4f4d-8ceb-fecc5983e751/0_0.png",
      "inner_image": "/Coordinator Pics/CodeClash/1.png",
      "description": "CodeClash is an engaging competition that combines coding challenges with interactive mini-games. Teams will test their problem-solving skills through a series of tasks, including blind coding, error correction, and a coding showdown. The event requires participants to excel in both coding and game performance.",
      "rules": "<ul><strong>Pre-requisites:</strong><ul><li>Proficiency in C++.</li><li>Basic understanding of debugging and problem-solving.</li><li>Familiarity with coding practices and logical reasoning.</li></ul></li><br><strong>General Rules and Regulations:</strong><ul><li>Each team will consist of 2 participants: a Coder and a Player.</li><li>The top 6 teams from Round 1 will receive a 10-minute advantage in Round 2.</li><li>The top 12 teams will advance from Round 1 to Round 2.</li><li>The top 4 teams from Round 2 will receive an additional 5 minutes in Round 3.</li><li>The top 6 teams will advance from Round 2 to Round 3.</li><li>In case of a tie, a sudden-death coding challenge will be used to determine the winner.</li><li>Teams should work together according to the format of each round.</li></ul></li><strong><br>Judging Criteria</strong><ul><li>Correctness: Accuracy and functionality of the solutions.</li><li>Performance: Effective use of the given time and resources.</li><li>Code Quality: Structure and efficiency of the code.</li><li>Mini-Game Score: Points earned in the mini-game segment.</li></ul></li></ul></li></ul>",
      "technical": true,
      "register": "https://forms.gle/WqgPePxXWeWdpsf66",
      "date": "<b><p>10th October 2024</b></p>",
      "time": "12:00 pm - 4:00 pm",
      "venue": "<p>Venue :<b>C1, C2, C3 Lab</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>2 participants per team</b></p>",
      "teamnumber": "2",
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "roundinfo": " <ul><br><strong>Round 1: Coding & Mini-Games (45 minutes)</strong><ul><li>Format: Each team consists of two participants: Coder and Player.</li><li>Objective: Solve a mathematical expression through coding and participate in a mini-game challenge.</li><br><li><strong>Part 1 - Blind Coding:</strong><ul><li>Task: Coder has 10 minutes to blind code a solution to a provided mathematical expression using C++. After 10 minutes, the code is tested.</li><li>Points: 30</li><li>Advantage: The top 6 teams get a 10-minute advantage in the next round.</li><li>Elimination: The top 12 teams advance to Round 2.</li></ul></li><br><li><strong>Part 2 - Mini-Game:</strong><ul><li>Task: Player participates in a mini-game similar to 'minute to win it' challenges for 10 minutes.</li><li>Points: Up to 20</li></ul></li></ul></li><br><strong>Round 2: Solve the Error (20 minutes)</strong><ul><li>Format: Teams are given a slightly complex logical problem with errors in a provided program.</li><li>Objective: Identify and correct the errors to ensure the program runs successfully.</li><li>Task: Both Coder and Player work together to debug and correct the provided program. The Player assists by reviewing the logic and suggesting possible corrections.</li><li>Points: 40</li><li>Advantage: The top 4 teams receive an additional 5 minutes in the final round.</li><li>Elimination: The top 6 teams proceed to Round 3.</li></ul></li><strong><br>Round 3: Coding Showdown (1 hour)</strong><ul><li>Format: A coding challenge where both participants tackle normal coding questions.</li><li>Objective: Solve as many coding problems as possible within the given time.</li><li>Task: Coder and Player decide whether to work separately on different problems or together on the same problems. The Player can assist by testing the solutions or suggesting strategies but cannot code.</li><li>Points: Points are awarded based on the number and complexity of problems solved.</li></ul></li><strong><br>Winner:</strong> The team with the highest score at the end wins the event.</li><br><strong><br>Tie Breaker Round</strong><ul><li>Task: If there's a tie, a sudden-death coding challenge determines the winner.</li></ul></li>",
      "eligibility": "Higher Secondary, Undergraduate and Diploma Students from professional and non-professional institutions.",
      "contacts": [
        {
          "name": "Jay Rane",
          "number": "https://wa.me/+918208516322",
          "image": "/Coordinator Pics/CodeClash/TE 1.jpeg"
        },
        {
          "name": "Kshitij Patil",
          "number": "https://wa.me/+919867420109",
          "image": "/Coordinator Pics/CodeClash/SE.jpeg"
        }
      ]
    },
    {
      "id": "5",
      "title": "ExQuizite",
      "image": "https://cdn.midjourney.com/d206d8a0-d0b0-414a-b506-45ff6af09c22/0_3.png",
      "inner_image": "/Coordinator Pics/ExQuizite/1.png",
      "description": "In CryptoQuest, participants are provided with code snippets that need to be combined to form a complete and functional solution to a given problem statement. This event tests logical thinking and coding skills in a challenging and engaging way.",
      "rules": "<strong>Pre-requisites:</strong><ul><li>Basic understanding of English grammar.</li><li>Proficiency in C, C++, or Python.</li><li>Understanding of basic data structures like stacks, queues, linked lists, etc.</li><li>Having some knowledge of ciphers like Caesar, Bacon, Vigenère, Mirror Writing, and Substitution will be helpful for participants.</li><li>Enthusiastic learners are encouraged to join and explore!</li></ul><br><strong>General Rules and Regulations:</strong><ul><li>Each team will consist of 2 participants.</li><li>Any number of teams from a college can participate.</li><li>Teams must report to the designated lab 30 minutes before the event starts.</li><li><strong>Round 1:</strong> Code will be provided without the main function; participants need to implement the main decryption logic. The code will be given in the language chosen by the team during registration (coordinators will show a demo of how the round works). One team member will write the code while the other decrypts a cipher on paper.</li><li><strong>Rounds 2 and 3:</strong> Participants will need to code from scratch for all tasks. In Round 2, the roles will be reversed: the team member who decrypted on paper in Round 1 will now write the code, and the other team member will decrypt a cipher on paper.</li><li>Hints related to mathematical equations or tables for decryption will be provided.</li><li>If participants can't figure out the code, hints can be provided at the cost of points.</li><li>The cipher description and the programming task will be provided during the event; they will not be disclosed beforehand.</li><li><strong>The tie-breaker round:</strong> Will be conducted in case of a tie. Preference will be given to the team that finishes the task first, and the final decision will be made by the Inspirus Coordinator and the HOD.</li><li>Participants should be comfortable with data structures like stacks, queues, arrays, linked lists, etc.</li><li>Participants should be familiar with ciphers such as Caesar, Bacon, Vigenère, Mirror Writing, Substitution, etc.</li><li>No web access will be provided during the event, and cheating or the use of external code will not be tolerated. Any violation of this rule will result in immediate disqualification from the event.</li></ul><br><strong>Judging Criteria:</strong><ul><li>Correctness of the Decrypted Message: Accuracy of the decrypted output.</li><li>Execution Time: Time taken to complete each round’s task.</li><li>Code Implementation: Structure and efficiency of the code.</li></ul>",
      "register": "https://forms.gle/fWL72L7XAi74V8mV9",
      "date": "<b><p>10th October 2024</b></p>",
      "time": "1:00 pm - 5:00 pm",
      "venue": "<p>Venue:<br><b>Preliminary round: C19 Lab (1st floor)<br>Main round: Seminar hall 2 (1st floor)</b></p>",
      "mode": "offline",
      "technical": true,
      "teamnumber": 2,
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "members": "<p>Members: <b>2 participants per team</b></p>",
      "eligibility": "Undergraduate and Diploma Students from professional and non-professional institutions.",
      "roundinfo": "<br><strong>Preliminary Round:</strong><br><ul><li>There will be exactly 5 teams moving onto the Main round. If more than 5 teams register, only then the preliminary round will be conducted to eliminate teams based on points.</li><li>The preliminary round format, scoring system and point-based elimination criteria will be announced before the start of the round.</li><li>In case of a tie during the preliminary round, an additional 10 MCQ questions will be asked to each of the teams on Kahoot.</li></ul><br><strong>Main Rounds:</strong><ul><li>The top 5 teams qualifying from the preliminary round will advance to the main round, where the final 2 winning teams will be determined.</li><li>If scores are tied for 1st or 2nd place in the main round, a tie-breaker round will be conducted to determine the winners.</li><li>The rules for each round will be clearly announced before the round begins.</li><li>Teams are responsible for understanding the rules; they may ask for clarification before the round starts. No objections will be entertained once the round has begun.</li></ul><br><strong>Tie-Breaker Rules:</strong><ul><li>In the case of a tie for 1st or 2nd place in the main round, the tie-breaker will consist of 6 sets with 3 questions each.</li><li>The team with the highest score in the tie-breaker will be declared the winner.</li><li>The order of set selection for the tie-breaker will be based on a coin toss.</li></ul>",
      "contacts": [
        {
          "name": "Eric Faleiro",
          "number": "https://wa.me/+918623069543",
          "image": "/Coordinator Pics/ExQuizite/TE 1.jpg"
        },
        {
          "name": "Sandeep Sawant",
          "number": "https://wa.me/+919552885824",
          "image": "/Coordinator Pics/ExQuizite/SE.jpeg"
        }
      ]
    },
    {
      "id": "6",
      "title": "CryptoQuest",
      "inner_image": "/Coordinator Pics/CryptoQuest/1.jpg",
      "image": "https://cdn.midjourney.com/a1713159-47a6-4e26-80db-dc171e603d0a/0_2.png",
      "description": "In CryptoQuest, participants are provided with code snippets that need to be combined to form a complete and functional solution to a given problem statement. This event tests logical thinking and coding skills in a challenging and engaging way.",
      "rules": "<strong>Pre-requisites:</strong><ul><li>Basic understanding of English grammar.</li><li>Proficiency in C, C++, or Python.</li><li>Understanding of basic data structures like stacks, queues, linked lists, etc.</li><li>Having some knowledge of ciphers like Caesar, Bacon, Vigenère, Mirror Writing, and Substitution will be helpful for participants.</li><li>Enthusiastic learners are encouraged to join and explore!</li></ul><br><strong>General Rules and Regulations:</strong><ul><li>Each team will consist of 2 participants.</li><li>Any number of teams from a college can participate.</li><li>Teams must report to the designated lab 30 minutes before the event starts.</li><li><strong>Round 1:</strong> Code will be provided without the main function; participants need to implement the main decryption logic. The code will be given in the language chosen by the team during registration (coordinators will show a demo of how the round works). One team member will write the code while the other decrypts a cipher on paper.</li><li><strong>Rounds 2 and 3:</strong> Participants will need to code from scratch for all tasks. In Round 2, the roles will be reversed: the team member who decrypted on paper in Round 1 will now write the code, and the other team member will decrypt a cipher on paper.</li><li>Hints related to mathematical equations or tables for decryption will be provided.</li><li>If participants can't figure out the code, hints can be provided at the cost of points.</li><li>The cipher description and the programming task will be provided during the event; they will not be disclosed beforehand.</li><li><strong>The tie-breaker round:</strong> Will be conducted in case of a tie. Preference will be given to the team that finishes the task first, and the final decision will be made by the Inspirus Coordinator and the HOD.</li><li>Participants should be comfortable with data structures like stacks, queues, arrays, linked lists, etc.</li><li>Participants should be familiar with ciphers such as Caesar, Bacon, Vigenère, Mirror Writing, Substitution, etc.</li><li>No web access will be provided during the event, and cheating or the use of external code will not be tolerated. Any violation of this rule will result in immediate disqualification from the event.</li></ul><br><strong>Judging Criteria:</strong><ul><li>Correctness of the Decrypted Message: Accuracy of the decrypted output.</li><li>Execution Time: Time taken to complete each round’s task.</li><li>Code Implementation: Structure and efficiency of the code.</li></ul>",
      "register": "https://docs.google.com/forms/d/e/1FAIpQLSdU0SXwym2RA79wo2DtJNvCzC26btH_zFlYb_hnWrkVXpyToQ/viewform?usp=sf_link",
      "technical": true,
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "date": "<b><p>11th October 2024</b></p>",
      "time": "9:30 am - 1:00 pm",
      "teamnumber": "2",

      "venue": "<p>Venue :<b>C1, C2, C3 Lab</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>2 per team</b></p>",
      "eligibility": "Higher Secondary, College and Diploma Students",
      "roundinfo": "<strong>Round 1: (45 minutes)</strong><br><strong>Description:</strong><br>Teams will work on two tasks simultaneously, with one participant focusing on one task and the other on a different task. Participants can assist each other if one task is completed early.<br><strong>Sub-Round 1A:</strong><br><ul><li><strong>Task:</strong> Participant 1 codes the decryption logic for the provided task using a code snippet without the main function.</li><li><strong>Points:</strong> 15</li><li><strong>Rules:</strong><br>1. Participants will receive a code snippet with the main function missing. They need to complete the main decryption logic.<br>2. A sample output will be provided.<br>3. A description of how to approach the task will be given.</li></ul><strong>Sub-Round 1B:</strong><br><ul><li><strong>Task:</strong> Participant 2 decrypts a provided cipher on paper.</li><li><strong>Points:</strong> 10</li><li><strong>Rules:</strong><br>1. Participants need to decrypt the provided cipher using the paper-based method.<br>2. A description of how to approach the task will be given.</li></ul><strong>Note:</strong><br>Teams must complete both tasks in this round to proceed to the next round. If either task is not completed, 5 points will be deducted for each incomplete task.<br><br><strong>Round 2: (45 minutes)</strong><br><strong>Description:</strong><br>This round continues to test the participants' cryptography skills, with roles reversed from Round 1. The team member who decrypted on paper in Round 1 will now write the code, and the other team member will decrypt a cipher on paper.<br><strong>Sub-Round 2A:</strong><br><ul><li><strong>Task:</strong> Participant 1 (who decrypted on paper in Round 1) will code the solution for a provided cipher task from scratch.</li><li><strong>Points:</strong> 15</li><li><strong>Rules:</strong><br>1. Participants must implement the program to solve the provided cipher using any data structure, such as stacks, queues, arrays, linked lists, etc.<br>2. A description of how to approach the task will be provided.</li></ul><strong>Sub-Round 2B:</strong><br><ul><li><strong>Task:</strong> Participant 2 (who coded in Round 1) will decrypt a provided cipher on paper.</li><li><strong>Points:</strong> 10</li><li><strong>Rules:</strong><br>1. Participants need to decrypt the provided cipher using a paper-based method.<br>2. A description of how to approach the task will be given.</li></ul><strong>Note:</strong><br>Teams must complete both tasks in this round to proceed to Round 3. If either task is not completed, 5 points will be deducted for each incomplete task.<br><br><strong>Round 3: (1 hour)</strong><br><strong>Description:</strong><br>In this round, participants will use a key obtained from the previous round to decode a cipher. This tests the participants' ability to apply cryptographic techniques and ensures the correct usage of provided data.<br><ul><li><strong>Task:</strong> Use the key obtained from the previous round to decode a provided cipher.</li><li><strong>Points:</strong> 35</li><li><strong>Rules:</strong><br>1. Participants must apply the key from the previous round directly to decrypt the provided cipher.<br>2. Do not attempt to brute force the key; use the provided key from the previous round.<br>3. Ensure correct application of the key for accurate decryption.<br>4. Any data structure can be used, such as stacks, queues, arrays, linked lists, etc.</li></ul><br><strong>Tie Breaker Round:</strong><br><strong>Description:</strong><br>The tie-breaker round is designed to resolve any ties that occur between teams. In this round, one participant from each tied team will decrypt a provided cipher using a paper-based method. The round is time-based; the first participant to solve the cipher wins the event.<br><ul><li><strong>Task:</strong> Decrypt a provided cipher on paper (only 1 participant).</li><li><strong>Rules:</strong><br>1. The tie-breaker will involve decrypting a cipher using a paper-based method.<br>2. Only one participant from the tied teams will participate in this round.<br>3. The first team to solve the cipher will win the event.</li></ul>",
      "contacts": [
        {
          "name": "Jayden D'Souza",
          "number": "https://wa.me/+919307259550",
          "image": "/Coordinator Pics/CryptoQuest/TE 1.jpeg"
        },
        {
          "name": "Shrinivas Inamdar ",
          "number": "https://wa.me/+917038823805",
          "image": "/Coordinator Pics/CryptoQuest/SE.jpeg"
        }
      ]
    },
    {
      "id": "7",
      "title": "Reel it Feel it",
      "image": "https://cdn.midjourney.com/e907935d-37ef-40ac-aeab-ec19d64a84e9/0_2.png",
      "inner_image": "/Coordinator Pics/Reel Ad Making/1.png",
      "description": "Reels have become a powerful medium for youth to express their creativity and set new trends on social media. Here’s your chance to showcase your talents and flex your creativity! Submit a 30-60 second reel and stand a chance to win exciting rewards and cash prizes.",
      "rules": "<strong>General Rules and Regulations</strong><ul><li>Inspiration can be drawn from existing trends online, but plagiarized content will result in disqualification.</li><li>Any derogatory remarks, name-calling, or regional slang targeting any person or community are strictly prohibited.</li><li>The use of offensive and inappropriate language or actions will lead to immediate disqualification.</li><li>The video should not exceed 1 minute.</li><li>Participants should submit only one reel; multiple entries will lead to disqualification.</li><li>The video should be made vertically (9:16 aspect ratio is preferred).</li></ul><br><strong>Theme:</strong><br><ul><li>Promote the INSPIRUS Event in your own creative way.</li></ul><br><strong>Procedure:</strong><br><ul><li>After successful registration, participants must post their reel on their Instagram account (after adding the entry details template).</li><li>Participants must post the reel on their Instagram account, add @inspirus.reels as a collaborator, and include the entry number and participant name in the caption along with ‘#inspirus2k24’ and tag @inspirus8.</li><li>Entries will be judged based on the criteria mentioned, as well as the number of likes and comments on the reel. (1 point is given for every 50 likes and unique comments, capped at 10 points).</li><li>The number of likes and comments as of 10th October (11:59 pm) will be considered.</li></ul><br><strong>Judging Criteria:</strong><li>Creativity: 10 points</li><li>Originality: 10 points</li><li>Editing: 10 points</li><li>Engagement: 10 points (based on the number of likes and comments on your reel)</li></ul><br><strong>For any queries, feel free to contact the coordinators.</strong>",
      "register": "https://forms.gle/YekCWHhXaE2bfX827",
      "date": "<p>Date: <b>Last Date for<br>Submission 2nd October 2024</b></p>",
      "time": "Deadline: 11:59 pm",
      "teamnumber": "1",
      "technical": false,
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "venue": "<p>Venue: <b>NA</b></p>",
      "mode": "Online",
      "members": "<p>Members: <b>Solo</b></p>",
      "eligibility": "Undergraduate and Diploma Students from professional and non-professional institutions.",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "contacts": [
        {
          "name": "Faizan Akabani",
          "number": "https://wa.me/+918390109186",
          "image": "/Coordinator Pics/Reel Ad Making/TE 1.jpg"
        },
        {
          "name": "Marco Goes",
          "number": "https://wa.me/+917019480358",
          "image": "/Coordinator Pics/Reel Ad Making/SE.jpg"
        }
      ]
    },
    {
      "id": "8",
      "title": "Meme-Off",
      "image": "https://cdn.midjourney.com/039e60c9-6ae9-4116-9eea-99aa3fd80a68/0_3.png",
      "description": "Love coding and making memes? Want to showcase your creativity and humor to the world?If so, join the “Meme-Off,” a fun-filled meme competition organized by the Computer Department of Don Bosco College of Engineering!This contest is your chance to craft and share memes that capture the essence of coding culture and the daily programming challenges we all face. Use any programming language, framework, tool, or concept as your inspiration—just make sure your memes are original, relevant, and most importantly, hilarious!",
      "rules": "<ul><li>Inspiration can be drawn from existing trends online, but plagiarized content will result in disqualification.</li><li>Any derogatory remarks, name-calling, or regional slang targeting any person or community are strictly prohibited.</li><li>The use of offensive and inappropriate language or actions will lead to immediate disqualification.</li><li>The video should not exceed 1 minute.</li><li>Participants should submit only one reel; multiple entries will lead to disqualification.</li><li>The video should be made vertically (9:16 aspect ratio is preferred).</li><li>Participants can start posting the reel as soon as the website goes live, and posting will be based on a first-come, first-served basis.</li></ul><strong>Theme:</strong><br>Promote the INSPIRUS Event in your own creative way.<br><strong>Procedure:</strong><ul><li>After successful registration, participants must post their reel on their Instagram account (after adding the entry details template).</li><li>Participants must post the reel on their Instagram account, add @inspirus.reels as a collaborator, and include the entry number and participant name in the caption along with ‘#inspirus2k24’ and tag @inspirus8.</li><li>Entries will be judged based on the criteria mentioned, as well as the number of likes and comments on the reel. (1 point is given for every 50 likes and unique comments, capped at 10 points).</li><li>The number of likes and comments as of 10th October (11:59 pm) will be considered.</li></ul><strong>For any queries, feel free to contact the coordinators.</strong>",
      "register": "https://forms.gle/vfxFSZhkFM86yoTcA",
      "inner_image": "/Coordinator Pics/Memes/1.png",
      "date": "<p>Date: <b>Last Date for<br>Submission 6th October 2024</b></p>",
      "time": "Deadline: 11:59 pm",
      "teamnumber": "1",
      "technical": false,
      "prizes": "<p>1st Place: ₹600</p><p>2nd Place: ₹500</p>",
      "venue": "<p>Venue: <b>NA</b></p>",
      "mode": "Online",
      "members": "<p>Members: <b>Solo</b></p>",
      "eligibility": "Open to students all across India.",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "contacts": [
        {
          "name": "Lauren Rodrigues",
          "number": "https://wa.me/+919156981587",
          "image": "/Coordinator Pics/Memes/TE 1.jpeg"
        },
        {
          "name": "Rakesh Chavan",
          "number": "https://wa.me/+917666472317",
          "image": "/Coordinator Pics/Memes/SE.jpg"
        }
      ]
    },
    {
      "id": "9",
      "title": "Cubix",
      "image": "https://cdn.midjourney.com/d6434eba-b6a9-414d-a8a9-e1f83230c90b/0_0.png",
      "description": "Contestants race against the clock to arrange the cube's colored faces into a uniform pattern, typically aligning all sides to have the same color. This event showcases the speed and dexterity of cubers as they manipulate the cube's complex twists and turns, impressing audiences with their ability to solve it in record times. Whether you're a novice or a seasoned cuber, this event is a captivating display of mental acumen and finger dexterity.",
      "rules": "<strong>General Rules and Regulations</strong><ul><li>Competitors must bring their own puzzles for the competition (3x3 Rubik’s cube).</li><li>Puzzles must be clean, and must not have any markings, elevated pieces, damage, or other differences that significantly distinguish any piece from a similar piece.</li><li>All solves will be timed on the computer.</li><li>An inspection time of 10 seconds would be given.</li><li>An average of 2 rounds will be taken.</li><li>If 2 or more participants have the same average time, there would be a tie-breaker round.</li><li>While competing, competitors must not use any electronics or audio equipment (e.g. cell phones, MP3 players, Dictaphones, additional lighting).</li></ul>",
      "register": "https://forms.gle/RrX3NgWSueAx22CS8",
      "inner_image": "/Coordinator Pics/Cubix/1.png",
      "date": "<p>Date: <b>10th October 2024</b></p>",
      "time": "11:00 am to 3:00 pm",
      "teamnumber": "1",
      "technical": false,
      "prizes": "<p>1st Place: ₹1000</p><p>2nd Place: ₹500</p>",
      "venue": "<p>Venue: <b>C5 and C6 Lab</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>Solo</b></p>",
      "eligibility": "Students from schools, high schools, higher secondary schools, undergraduates, and diploma holders from professional and non-professional institutions.",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "contacts": [
        {
          "name": "Sherwin Lourenco",
          "number": "https://wa.me/+917391804162",
          "image": "/Coordinator Pics/Cubix/TE 1.jpeg"
        },
        {
          "name": "Cynora Rodrigues",
          "number": "https://wa.me/+919309501536",
          "image": "/Coordinator Pics/Cubix/SE.jpeg"
        }
      ]
    },
    {
      "id": "10",
      "title": "Veil of secrets",
      "image": "https://cdn.midjourney.com/f7c94415-9c72-450a-a635-4912f1a46e8b/0_1.png",
      "inner_image": "/Coordinator Pics/Veil of Secrets/1.png",
      "description": "Dive into an exhilarating adventure where the worlds of escape rooms and treasure hunts collide! “Veil of Secrets” is an immersive, interactive event that challenges your problem-solving skills, teamwork, and wit as you race against the clock to solve puzzles, unlock secrets, and find hidden treasures.",
      "rules": "<strong>Rules:</strong><br><ul><li>Registration will be through ONLINE form.</li><li>The registration form should be filled by team leaders only once.</li><li>Any team submitting more than one form will be disqualified.</li><li>Only team leaders should join the whatsapp group via the link provided after the submission of the form.</li><li>All team members should report to the venue 15 minutes before the start of the event. Late arrivals may result in a reduced playtime.</li><li>The event consists of 3 rounds.</li></ul></li></ul><br><strong>Note:</strong><br><ul><li>All team members should carry their ID cards.</li><li>The use of personal tools, such as cell phones, cameras, or any other gadgets, is strictly prohibited during the game.</li><li>In case of discrepancy, decisions made by the coordinators will be final.</li></ul>",
      "register": "https://forms.gle/VLgRXzDhADeDVVes5",
      "date": "<p>Date: <b>11th October 2024</b></p>",
      "time": "9:30 am to 2:00 pm",
      "technical": false,
      "teamnumber": "3",
      "prizes": "<p>1st Place: ₹2000</p><p>2nd Place: ₹1000</p>",
      "venue": "<p>Venue: <b>C4,C5,C6 and FE COMP Classroom</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>3 per Team (Max 30 teams)</b></p>",
      "eligibility": "Undergraduate and Diploma Students from professional and non-professional institutions.",
      "roundinfo": "<br><strong>Round 1:</strong><br><ul><li>Round 1 will be an aptitude and logical reasoning round.</li><li>The duration will be 15 minutes.</li><li>Teams will be selected for round 2 based upon the maximum scores.</li><li>Out of maximum teams participation only 12-14 teams will be qualified for the next round.</li><li>If there is a tie between two teams, the team that used less time to complete the task will be given priority for qualification.</li></ul><br><strong>Round 2:</strong><br><ul><li>Round 2 will be based on puzzle solving.</li><li>Time limit is 15 minutes.</li><li>Only TOP 5 teams will qualify for round 3 based on the maximum number of scores.</li><li>If there is a tie between two teams, the team that used less time to complete the task will be given priority for qualification.</li></ul><br><strong>Round 3:</strong><br><ul><li>Round 3 consists of Escape Room and Treasure Hunt.</li><li>Teams must solve a series of puzzles and perform tasks to find the hidden clues.</li><li>Each clue leads to the next puzzle or location.</li><li>Teams are allowed to communicate freely among themselves. However, no communication with other teams or external help is permitted.</li><li>If two or more teams find the treasure simultaneously then a tie breaker round will be held and the first team to complete the task will be the winner.",
      "contacts": [
        {
          "name": "Meha Dangui",
          "number": "https://wa.me/+918421640719",
          "image": "/Coordinator Pics/Veil of Secrets/TE 1.jpg"
        },
        {
          "name": "Diya Shanbhag",
          "number": "https://wa.me/+917387797988",
          "image": "/Coordinator Pics/Veil of Secrets/SE.jpg"
        }
      ]
    },
    {
      "id": "11",
      "title": "Masterclass",
      "image": "https://cdn.midjourney.com/b4b77471-0f30-437b-b43f-afa1a0da0cec/0_3.png",
      "description": "An interactive session where resource persons and faculty come together to explore intriguing topics at the intersection of teaching and computer technology. Participants will benefit from insightful lectures and dynamic discussions aimed at enhancing their understanding of these subjects.",
      "rules": "<strong>General Rules:</strong><br>Workshop 1:  10:00 to 10:45 am<br>Workshop 2: 10:45- 11:30 am<br>Registration is free of cost.<br>Registration will be done primarily online through a Google Form, but offline registrations will also be open on the day of the Workshop.<br>Participation Certificate will be given to all those who attend the Workshop.",
      "register": "https://forms.gle/6kFUVZJgMdnmiGCE8",
      "date": "<p>Date: <b>11th October 2024</b></p>",
      "inner_image":"/Coordinator Pics/Masterclass/masterclass.jpeg",
      "technical": true,
      "time": "10:00 am to 12:00 pm",
      "venue": "<p>Venue: <b>Seminar Hall 2(First floor)</b></p>",
      "mode": "offline",
      "members": "<p>Members: <b>NA</b></p>",
      "eligibility": "Faculty from Undergraduate, Diploma, Professional and Non-professional institutes, and Higher Secondary Schools and High Schools.",
      "roundinfo": "<center><strong>No detours, no rounds—just the final showdown!</strong></center>",
      "contacts": [
        {
          "name": "Griselda Fernandes",
          "number": "https://wa.me/+917887868427",
          "image": "/Coordinator Pics/Masterclass/Griselda.png"
        },
        {
          "name": "Ananya Sawant",
          "number": "https://wa.me/+916366145473",
          "image": "/Coordinator Pics/Masterclass/Ananya.jpeg"
        }
      ]
    }
  ]
}
